IDEA StatiCa Open Model
CutData Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Provides data of the cut beam
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.CutData
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class CutData
Public Class CutData
public ref class CutData
The CutData type exposes the following members.
Constructors
Name | Description
CutData
Initializes a new instance of the CutData class
Top
Properties
Name | Description
NormalVector
 Plane normal
PlanePoint
 3DPlane Point
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace